src/Enums/СостоянияВерсийЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияВерсийЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытПринудительно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеНаПодписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПолучен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЗавершенСИсправлением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяИзвещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяИзвещениеОПолучении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяИсполнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяКорректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяОтправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяОтправкаИзвещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяОтправкаПолучателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПередачаОператору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПодтверждениеОператора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежИсполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяАннулировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяУточнитьДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформированУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформированУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученУКД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ОбменСКонтрагентами/Ext/Module.bsl
Функция СтатусДокументооборота(Ссылка) Экспорт
	
	Результат = ЭлектронныеДокументыСлужебный.ПолучитьСтруктуруВерсииЭД(Ссылка);
	Результат.Вставить("ЭлектронныйДокумент", Результат.СсылкаНаДокумент);
	Результат.Вставить("Статус",              "НеНачат");
	
	Если Не ЗначениеЗаполнено(Результат.ЭлектронныйДокумент) Тогда 
		Результат.ЭлектронныйДокумент = Неопределено;
	КонецЕсли;
	
	СостояниеВерсииЭлектронногоДокумента = Результат.СостояниеВерсииЭД;
	// Переведем статус в "простую" классификацию.
	Если СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.Аннулирован
		ИЛИ СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ЗакрытПринудительно
		ИЛИ СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ОбменЗавершенСИсправлением
		ИЛИ СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ОжидаетсяКорректировка
		ИЛИ СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.Отклонен
		ИЛИ СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ТребуетсяУточнитьДокумент Тогда
		
		Результат.Статус = "Отклонен";
	ИначеЕсли СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ИзвещениеНаПодписи
		ИЛИ СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ОбменЗавершен
		ИЛИ СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ОжидаетсяИзвещениеОПолучении
		ИЛИ СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ОжидаетсяОтправкаИзвещения Тогда
		
		Результат.Статус = "Утвержден";
	ИначеЕсли СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.НаПодписи
		ИЛИ СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ОжидаетсяПередачаОператору Тогда
		
		Результат.Статус = "ВОбработке";
		
	ИначеЕсли СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ОжидаетсяОтправка
		ИЛИ СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ОжидаетсяОтправкаПолучателю Тогда
		
		Результат.Статус = "ВОбработке";
		
	ИначеЕсли СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ОжидаетсяПодтверждение Тогда
		
		Результат.Статус = "Утвержден";
		
	ИначеЕсли СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.НаУтверждении Тогда
		
		Результат.Статус = "Получен";
	ИначеЕсли СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.НеПолучен
		ИЛИ СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.НеСформирован Тогда
		
		Результат.Статус = "НеНачат";
	ИначеЕсли СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ОжидаетсяАннулирование
		ИЛИ СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ТребуетсяАннулировать Тогда
	
		Результат.Статус = "ОтклонениеВОбработке";
	ИначеЕсли СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ОшибкаПередачи Тогда
		
		Результат.Статус = "Ошибка";
	ИначеЕсли СостояниеВерсииЭлектронногоДокумента = Перечисления.СостоянияВерсийЭД.ПустаяСсылка() Тогда
		
		Результат.Статус = "ЭДОНеНастроен";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьПравоОбработкиЭД() Экспорт 
	
	Возврат ПравоДоступа("Просмотр", Метаданные.Обработки.ТекущиеДелаПоЭДО);
	
КонецФункции

/////////////////////////////////////////////////////////////////////////
// Требуется встраивание для блока проверки документа на требования ГИСМТ
// Заглушка
//
Функция СведенияОбЭлектронномДокументе(ЭлектронныйДокумент) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ОбъектыУчета", Новый Массив);
	Возврат Результат;
	
КонецФункции

Функция НастройкиОтправки(Документы) Экспорт 
	
	Результат = Новый Соответствие;
	Возврат Результат;
	
КонецФункции
